//********************************************************************************
//  HitCheck.h
//  test
//
//  Created by 丸山 潤 on 2014/10/08.
//
//********************************************************************************
//********************************************************************************
// インクルードガード
//********************************************************************************
#ifndef __test__HitCheck__
#define __test__HitCheck__

//********************************************************************************
// インクルード
//********************************************************************************
#include "cocos2d.h"

//********************************************************************************
// 名前空間の使用
//********************************************************************************
using namespace cocos2d;

//********************************************************************************
// クラス宣言
//********************************************************************************
class HitCheck
{
public:
    HitCheck(){}
    ~HitCheck(){}
    
    //================================================================================
    // brief    :点と四角形のあたり判定
    // arg      :点の座標
    //          :四角形の中心座標
    //          :四角形の角辺の長さの半分
    // return   :当たっているか否か(当たっている:true/当たっていない:false)
    //================================================================================
    static bool hitCheckPointAndBox(const Vec2& pointPos,const Vec2& boxPos,const Vec2& sizeHalf);
    
    //================================================================================
    // brief    :点と円のあたり判定
    // arg      :点の座標
    //          :円の中心座標
    //          :円の半径
    // return   :当たっているか否か(当たっている:true/当たっていない:false)
    //================================================================================
    static bool hitCheckPointAndCircle(const Vec2& pointPos,const Vec2& circlePos,const float& radius);
    
    //================================================================================
    // brief    :円と円のあたり判定
    // arg      :１つ目の円の中心座標
    //          :１つ目の円の半径
    //          :２つ目の円の中心座標
    //          :２つ目の円の半径
    // return   :当たっているか否か(当たっている:true/当たっていない:false)
    //================================================================================
    static bool hitCheckCircleAndCircle(const Vec2& circlePos1,const float& radius1,
                                        const Vec2& circlePos2,const float& radius2);
};

#endif /* defined(__test__HitCheck__) */
